output.xml

<soapenv:Envelope 
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
  xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Add>
            <tem:intA>?</tem:intA>
            <tem:intB>?</tem:intB>
      </tem:Add>
   </soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope 
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
  xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Divide>
            <tem:intA>?</tem:intA>
            <tem:intB>?</tem:intB>
      </tem:Divide>
   </soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope 
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
  xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Multiply>
            <tem:intA>?</tem:intA>
            <tem:intB>?</tem:intB>
      </tem:Multiply>
   </soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope 
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
  xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Subtract>
            <tem:intA>?</tem:intA>
            <tem:intB>?</tem:intB>
      </tem:Subtract>
   </soapenv:Body>
</soapenv:Envelope>

