api-management/apis/calculator__1[Current]/operations/POST___soapAction=http___t3H6E6O.request.application_soap+xml.html

<?xml version="1.0" encoding="utf-8"?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope">
  <Body>
    <Subtract xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://tempuri.org/">
      <intA>1</intA>
      <intB>1</intB>
    </Subtract>
  </Body>
</Envelope>